Repository: Kakadu/marionnet
Catalog: po/*.po
Languages: fr

source: Continuing anyway, but *some important features will be missing*.
fr: Certaines fonctionnalités importantes peuvent ne pas fonctionner ou être inaccessibles.

source: (Ungracefully) shutdown every element of the network, as in a power-off
fr: Éteindre brutalement tous les éléments du réseau comme lors d'une panne de courant (power off)

source: <b>Marionnet</b> is an environment for the simulation of a network composed of GNU/Linux machines. This software was thought for students to experiment with bulding and configuring networks, and for teachers to prepare excercises and tests. Marionnet is based on the UML features of the Linux kernel. <tt><u><span color="blue">http://www.marionnet.org</span></u></tt>
fr: <b>Marionnet</b> est un environnement de simulation de réseaux composés de machines GNU/Linux. Ce logiciel permet, d'une part, aux étudiants de s'entraîner à la mise en place (câblage et configuration) d'un réseaux et, d'autre part, aux enseignants de définir leurs énoncés de TP et/ou contrôles réseaux. Ce logiciel est basé sur les fonctionnalités UML (User Mode Linux) du noyau Linux. <tt><u><span color="blue">http://www.marionnet.org</span></u></tt>

source: <i>Components</i>
fr: <i>Composants</i>

source: A file with the same name already exists! Choose another name for your file.
fr: Un fichier de même nom existe déjà! Vous devez choisir un nouveau nom pour votre fichier.

source: A slow operation is in progress
fr: Une opération lente est en cours

source: ADD OR MODIFY A CLOUD
fr: AJOUTER OU MODIFIER UN NUAGE

source: ADD OR MODIFY A CROSSOVER CABLE
fr: AJOUTER OU MODIFIER UN CÂBLE CROISÉ

source: ADD OR MODIFY A HUB
fr: AJOUTER OU MODIFIER UN CONCENTRATEUR (HUB)

source: ADD OR MODIFY A ROUTER
fr: AJOUTER OU MODIFIER UN ROUTEUR

source: ADD OR MODIFY A STRAIGHT CABLE
fr: AJOUTER OU MODIFIER UN CABLE DROIT

source: ADD OR MODIFY A SWITCH
fr: AJOUTER OU MODIFIER UN COMMUTATEUR (SWITCH)

source: ADD OR MODIFY A VIRTUAL MACHINE
fr: AJOUTER OU MODIFIER UNE MACHINE VIRTUELLE

source: ADD OR MODIFY A WORLD BRIDGE
fr: AJOUTER OU MODIFIER UN BRIDGE

source: About
fr: À Propos

source: Activation scenario
fr: Activation du scenario

source: Add
fr: Ajouter

source: Add cloud
fr: Ajouter un nuage

source: Add crossover cable
fr: Ajouter un câble croisé

source: Add hub
fr: Ajouter un concentrateur (Hub)

source: Add machine
fr: Ajouter une machine

source: Add router
fr: Ajouter un routeur

source: Add straight cable
fr: Ajouter un câble droit

source: Add switch
fr: Ajouter un commutateur (switch)

source: Add world bridge
fr: Ajouter un bridge

source: Add world gateway
fr: Ajouter une passerelle

source: Amount of RAM to be reserved for this machine.
fr: Quantité de mémoire vive (RAM) à reserver pour l'exécution de cette machine virtuelle (en Méga octets).

source: Are you sure that you want to power off all the running components? It is also possible to shut them down graciously...
fr: Êtes-vous sûr de vouloir débrancher le courant (électrique) pour tous les composants ? Il est également possible de les éteindre proprement avec le bouton "Tout Arrêter".

source: Are you sure that you want to remove %s and all the cables connected to this %s?
fr: Confirmez-vous la suppression de %s et de tous les câbles éventuellement branchés à ce %s ?

source: Are you sure that you want to remove the crossover cable %s?
fr: Êtes vous sur de vouloir enlever le câble croisé nommé %s ?

source: Are you sure that you want to remove the straight cable %s?
fr: Êtes vous sûr de vouloir enlever le câble droit nommé %s ?

source: Are you sure that you want to stop all the running components?
fr: Êtes-vous sûr de vouloir éteindre tous les composants ?

source: Arrange edges left-to-right
fr: Dessiner les arcs de la gauche vers la droite

source: Arrange edges top-to-bottom
fr: Dessiner les arcs du haut vers le bas

source: Arrange edges top-to-bottom (default)
fr: Tracer les arcs du haut vers le bas (par défault)

source: Author
fr: Auteur

source: Authors
fr: Auteurs

source: Auto-generation of IP address
fr: Auto-génération des adresses IP

source: Broadcast
fr: Diffuser

source: Broadcast the specification of the virtual network on a real network
fr: Envoyez la définition du réseau virtuel à travers le réseau (hôte)

source: CHOOSE A NAME FOR THE PROJECT
fr: CHOISIR UN NOM POUR LE PROJET

source: Cable %s reversed
fr: Câble %s renversé

source: Canvas size
fr: Taille du canevas

source: Choose the document to import
fr: Choisissez le document à importer

source: Choose the variant name
fr: Choix du nom de la variante

source: Close
fr: Fermer

source: Collapse all
fr: Tout réduire

source: Comment
fr: Commentaire

source: Connecting to the Marionnet daemon failed (%s); Marionnet will work, but some features (graphics on virtual machines and host sockets) won't be available.
fr: La connexion avec le démon a échoué (%s); Marionnet fonctionnera mais certaines fonctionnalités ne seront pas disponibles (telles que la connexion de prise internet au réseau local et lancement de machines virtuelles utilisant une interface graphique - donc pas de support tun/tap).

source: Copy to
fr: Copier sous

source: Could not connect to the daemon
fr: Connexion avec le démon impossible

source: Crossover cable
fr: Câble croisé

source: DHCP service
fr: service DHCP

source: Debug mode
fr: Mode debug

source: Default icon arrangement:
fr: Agencement par défaut des icônes :

source: Defects
fr: Anomalies

source: Delete this state
fr: Éliminer cet état

source: Disconnect
fr: Débrancher brutalement

source: Disks
fr: Disques

source: Display this document
fr: Afficher ce document

source: Distance between labels and icons
fr: Distance entre les étiquettes et les icônes

source: Do you want to save the current project before quitting?
fr: Voulez-vous enregistrer le projet courant avant de quitter ?

source: Do you want to save the current project?
fr: Voulez-vous enregistrer le projet courant ?

source: Edges
fr: Arcs

source: Enter the new variant name; this name must begin with a letter and can contain letters, numbers, dashes and underscores.
fr: Entrez le nom de la nouvelle variante; ce nom doit commencer par une lettre et ne peut contenir que des lettres, chiffres, tirets et tirets bas (underscores).

source: Error
fr: Erreur

source: Error in trying to communicate with the daemon. The application should remain usable, but without the features requiring root access...
fr: Échec des communications avec le démon La communication avec le démon a été interrompue. L'application reste utilisable mais certaines choses ne vont plus fonctionner correctement (connexion de nouvelle prise internet au réseau local et lancement de machines virtuelles utilisant une interface graphique donc pas de support tun/tap).

source: Ethernet cards
fr: Cartes Ethernet

source: Ethernet port
fr: Le port ethernet du nœud

source: Expand all
fr: Tout développer

source: Export as machine variant
fr: Exporter comme variante de machine

source: Export as router variant
fr: Exporter comme variante de routeur

source: Export image
fr: Exporter l'image

source: Export network image
fr: Exporter l'image du reseau

source: Failed to copy the project into the file
fr: Échec de la copie du projet dans le fichier

source: Failed to export network image to the file
fr: Échec lors de la sauvegarde de l'image dans

source: Failed to open the file
fr: Échec lors de l'ouverture du fichier

source: Failed to save the project into the file
fr: Échec de la sauvegarde du projet vers

source: Failure in daemon communication
fr: Échec des communications avec le démon

source: File choice
fr: Choix du fichier

source: First byte of the IPv4 address
fr: Premier octet de l'adresse IPv4

source: Flipped bits %
fr: Bits inversés %

source: Fourth byte of the IPv4 address
fr: Quatrième octet de l'adresse IPv4

source: From
fr: De

source: GNU/Linux distribution installed on the virtual machine.
fr: Distribution GNU/Linux installée sur la machine virtuelle.

source: Go back to the standard node arrangement (not random)
fr: Revenir à l'agencement prédéfini (non aléatoire) des noeuds

source: Gracefully stop every element of the network
fr: Éteindre proprement tous les éléments du réseau (shutdown)

source: Help
fr: Aide

source: History
fr: Historique

source: History of
fr: Historique de

source: Hub
fr: Concentrateur (hub)

source: Hub name. This name must be unique in the virtual network. Suggested: H1, H2, ...
fr: Le nom du concentrateur (hub). Ce nom doit être unique dans le réseau virtuel (et ne pas contenir de '.' point). Suggestion : H1, H2,...

source: Hub ports number
fr: Nombre de ports du concentrateur (hub)

source: IPv4 address
fr: Adresse IPv4

source: IPv4 broadcast
fr: Broadcast IPv4

source: IPv4 configuration of the first router port (0)
fr: Configuration IPv4 de la première interface du routeur (port (0))

source: IPv4 netmask
fr: Masque réseau IPv4

source: IPv6 address
fr: Adresse IPv6

source: Icon
fr: Icône

source: Icons randomly arranged:
fr: Icônes réagencées de façon aléatoire :

source: Import a document
fr: Importer un document

source: In this dialog window you can define the name of a cloud. This component is an Ethernet network with an unknown internal structure introducing delays and other anomalies when packets pass through. Once the cloud is defined, use the tab 'Anomalies' to control delays, frame loss and the other anomalies.
fr: Dans cette fenêtre de dialogue vous pouvez définir le nom d'un 'nuage'. Ce composant est un réseau Ethernet, dont la structure interne n'est pas connue, mais qui provoque des rétards ou d'autres anomalies lors d'un passage de trames entre ses deux extrémités. Une fois le nuage défini, utilisez l'onglet 'Anomalies' pour régler les retards, les pertes de trames et les autres anomalies que vous souhaitez provoquer entre les deux extrémités du nuage.

source: In this dialog window you can define the name of a crossover Ethernet cable and set its parameters: - Label: a string appearing near the edge representing the cable in the network graph - Devices: the two network devices (machine, hub, ...) linked by the cable and their two connected interfaces WARNING: this dialog allows to define crossover cables even in contexts where they won't work (for example between two machines); allowing users to define 'wrong' connections may be of some pedagogical interest.
fr: Dans cette fenêtre de dialogue vous pouvez définir le nom d'un câble Ethernet croisé et certains paramètres de configuration : - Étiquette : une chaîne de caractère qui apparaît près de l'icône du câble dans le graphe du réseau; ce champ est utilisé exclusivement à des fins graphiques, il n'est pas pris en compte à des fins de configuration. - Les colonnes "De" et "Vers" permettent respectivement de définir à travers les champs "Nom" et "port", le nom du périphérique et l'interface qui seront connectés à une extrémité du câble puis à l'autre. ATTENTION: Cette fenêtre de dialogue autorise la configuration directe des câbles et permet donc de faire des configurations non fonctionnelles (comme connecter deux PCs avec un câble droit) car cela peut avoir un intérêt pédagogique.

source: In this dialog window you can define the name of a straight Ethernet cable and set its parameters: - Label: a string appearing near the edge representing the cable in the network graph - Devices: the two network devices (machine, hub, ...) linked by the cable and their two connected interfaces WARNING: this dialog allows to define straight cables even in contexts where they won't work (for example between two machines); allowing users to define 'wrong' connections may be of some pedagogical interest.
fr: Dans cette fenêtre de dialogue vous pouvez définir le nom d'un câble Ethernet droit et certains paramètres de configuration : - Étiquette : une chaîne de caractères qui apparaît près de l'icône du câble dans le graphe du réseau; ce champ est utilisé exclusivement à des fins graphiques, il n'est pas pris en compte à des fins de configuration. - Les colonnes "De" et "Vers" permettent respectivement de définir à travers les champs "Nom" et "port", le nom du périphérique et l'interface qui seront connecté à une extrémité du câble puis à l'autre. ATTENTION: Cette fenêtre de dialogue autorise la configuration directe des câbles et permet donc de faire des configurations non fonctionnelles (comme connecter deux PCs avec un câble droit) car cela peut avoir un intérêt pédagogique.

source: In this dialog window you can define the name of an Ethernet HUB and set parameters for it: - Label: a string appearing near the hub icon in the network graph; it may allow, for example, to know at a glance the Ethernet network realized by the device; this field is exclusively for graphic purposes, is not taken in consideration for the configuration. - Nb of Ports: the number of ports of the hub (default 4); this number must not be increased without a reason, because the number of processes needed for the device emulation is proportional to his ports number.
fr: Dans cette fenêtre de dialogue vous pouvez définir le nom d'un concentrateur Ethernet (hub) et configurer certains paramètres : - Étiquette: chaîne de caractères utilisée pour décorer l'icône du répéteur dans l'image du réseau; ceci permet de savoir en un clin d'oeil le réseau Ethernet (par exemple '192.168.1.0/24') que le composant réalise ou doit réaliser; ce champ est utilisé exclusivement à des fins graphiques, il n'est pas pris en compte à des fins de configuration. - Nb de Ports: le nombre de ports du répéteur (4 par défaut); ce nombre ne doit pas être inutilement grand, le nombre de processus nécessaires à l'émulation de ce composant étant proportionnel au nombre de ses ports.

source: In this dialog window you can define the name of an Ethernet socket and set parameters for it. This component allows to connect the virtual network to a Linux bridge whose name is defined by the user via the configuration variable called MARIONNET_BRIDGE (in marionnet.conf or provide on the command line). If the bridge is correctly set on the host (before starting the network), virtual machines will be able to access to the same network services (DHCP, DNS, NFS, ...) that the host can access on its local network; if the host is on the Internet then also the virtual machines linked to the socket will be. To create a bridge on your (real) host using the same network as eth0 (by example) you need to : 1) create a bridge with the name define in marionnet.conf by MARIONNET_BRIDGE, 2) put and configure eth0 (on your real host) in the bridge and 3) put an IP address on the bridge (with dhclient or ifconfig/route). In such a case, after having start the virtual network in marionnet you can configure an ethernet card of a virtual machines which is connect to the Ethernet socket (or on the same network) in order to give access to your local network to it. The socket also allows team-work in a network laboratory, by creating a connection between Marionnet instances running on different machines. For more information about bridge et Ethernet socket configuration, please see the Marionnet Wiki on the marionnet.org website.
fr: Dans cette fenêtre de dialogue vous pouvez définir le nom d'une prise Ethernet et configurer certains paramètres. Ce composant permet de connecter le réseau virtuel (de Marionnet) à un Bridge (pont) Linux dont le nom est défini par l'utilisateur via la variable de configuration appelée MARIONNET_BRIDGE (dans marionnet.conf ou à travers la ligne de commande). Si le bridge est correctement configuré sur l'hôte (avant de démarrer le réseau) alors les machines virtuelles pourront avoir accès aux mêmes services (DHCP, DNS, NFS, ...) que l'hôte. Si l'hôte a accès a Internet alors les machines du du réseau virtuel connectées a la prise Ethernet y auront également accès. Pour créer un bridge sur l'hôte utilisant le même réseau que eth0 (par exemple) vous devez 1) créer un bridge avec le nom défini par la variable de configuration MARIONNET_BRDIGE, 2) mettre eth0 dans le bridge et la configurer (sur votre machine, pas dans marionnet) et enfin 3) donner une adresse IP au bridge (avec dhclient ou ifconfig/route). Une fois cela fait et après avoir démarrer le réseau virtuel de marionnet, vous pourrez configurer une interface Ethernet sur une machine virtuelle qui est connecté à la prise Ethernet (ou sur le même réseau) afin de lui donner accès a votre réseau local. La prise Ethernet permet également à plusieurs groupes d'étudiants d'interconnecter les différents réseaux des instances de marionnet s'exécutant sur plusieurs postes. Pour avoir plus d'information concernant la configuration des prises Ethernet et des bridge, consultez s'il vous plaît le Wiki du projet Marionnet sur le site web marionnet.org.

source: In this dialog window you can define the name of an Ethernet switch and set parameters for it: - Label: a string appearing near the switch icon in the network graph; it may allow, for example, to know at a glance the Ethernet network realized by the device; this field is exclusively for graphic purposes, is not taken in consideration for the configuration. - Nb of Ports: the number of ports of the switch (default 4); this number must not be increased without a reason, because the number of processes needed for the device emulation is proportional to his ports number.
fr: Dans cette fenêtre de dialogue vous pouvez définir le nom du commutateur Ethernet (switch) et configurer certain paramètres : - Étiquette: chaîne de caractères utilisée pour décorer l'icône du switch dans l'image du réseau; ceci permet de savoir en un clin d'oeil le réseau Ethernet (par exemple '192.168.1.0/24') que le composant réalise ou doit réaliser; ce champ est utilisé exclusivement à des fins graphiques, il n'est pas pris en compte à des fins de configuration. - Nb de Ports: le nombre de ports du switch (4 par défaut); ce nombre ne doit pas être inutilement grand, le nombre de processus nécessaires à l'émulation de ce composant étant proportionnel au nombre de ses ports.

source: In this dialog window you can define the name of an IP router and set many parameters for it: - Label: a string appearing near the router icon in the network graph; this field is exclusively for graphic purposes, is not taken in consideration for the configuration. - Nb of Ports: the number of ports of the router (default 4); this number must not be increased without a reason, because the number of processes needed for the device emulation is proportional to his ports number. The emulation of this device is realised with the program 'quagga' derived from the project 'zebra'. Every interface of the router can be configured in the tab 'Interfaces'. Once started, the router will answer to the telnet protocol on every configured interface, on the following tcp ports: zebra 2601/tcp # zebra vty ripd 2602/tcp # RIPd vty ripngd 2603/tcp # RIPngd vty ospfd 2604/tcp # OSPFd vty bgpd 2605/tcp # BGPd vty ospf6d 2606/tcp # OSPF6d vty isisd 2608/tcp # ISISd vty Password: zebra
fr: Dans cette fenêtre de dialogue vous pouvez définir le nom du routeur IP (OSI 3) et certains paramètres de configuration : - Étiquette : une chaîne de caractères qui apparaît près de l'icône du routeur dans le graphe du réseau; ce champ est utilisé exclusivement à des fins graphiques, il n'est pas pris en compte à des fins de configuration. - Nb de Ports: le nombre de ports du routeur (4 par défaut); ce nombre ne doit pas être inutilement grand, le nombre de processus nécessaires à l'émulation de ce composant étant proportionnel au nombre de ses ports. - Adresse IP : l'adresse IP de la première interface du routeur (port 0) suivie du masque réseau (Netmask, en notation CIDR). Le routage sur cette machine est réalisé par le logiciel 'quagga' dérivé du projet 'zebra'. Chaque interface du routeur peut être configurée via l'onglet 'Interfaces'. Une fois démarré, on peut se connecter au routeur par n'importe quelle interface configurée en utilisant la commande telnet sur les ports tcp suivants (avec pour login et password : "zebra"). zebra 2601/tcp # zebra vty ripd 2602/tcp # RIPd vty ripngd 2603/tcp # RIPngd vty ospfd 2604/tcp # OSPFd vty bgpd 2605/tcp # BGPd vty ospf6d 2606/tcp # OSPF6d vty isisd 2608/tcp # ISISd vty

source: In this dialog window you can define the name of the virtual machine and set several hardware and software parameters. SECTION 'Hardware' - Memory: amount of memory (RAM) that will be reserved on the host for this virtual machine (default 48 Mb) - Ethernet Card: number of Ethernet cards (defalut 1) SECTION 'Software': - Distribution: the GNU/Linux distribution (Debian, Mandriva, Gentoo,..), chosen among those available in the filesystem directory - Variant: a variant (or patch) of the given distribution; a variant is a COW (Copy On Write) file that represents a small update of the used distribution.Available variants are in the variants/ subdirectory of the filesystem directory. You can make your own variants by exporting any virtual machine state in the 'Disks' tab. - Kernel: the Linux kernel version, chosen among the ones available in the kernels/ subdirectory SECTION 'UML': - Terminal: the possible choices are 'X HOST' and 'X NEST'; the first one allows to run graphic applications from a text terminal where the user can operate the virtual machine (with user 'root' and password 'root'); the second allows to have a real graphic server reserved for the virtual machine, with independent windows manager and desktops environments.
fr: Dans cette fenêtre de dialogue vous pouvez définir le nom et différents attributs matériels ou logiciels d'une machine virtuelle. SECTION 'Hardware' - Mémoire : quantité de mémoire vive (RAM) qui sera réservée pour cette machine virtuelle (par défaut 48 Mo). - Cartes Ethernet : le nombre de carte réseau de type Ethernet dont disposera la machine virtuelle (par défaut 1). SECTION 'Software': - Distribution : la distribution GNU/Linux (Debian, Mandriva, Gentoo,..) choisie parmi celles disponibles dans le répertoire des systèmes de fichiers. - Variante : une variante disponible pour une distribution donnée; une variante est un état précédemment enregistré d'un système de fichiers donné, c'est un fichier de différence de type COW (Copy-On-Write, sorte de patch de niveau bloc) créé à partir d'un système de fichiers (démarré, modifié puis conservé en l'état) et ne pouvant être appliqué qu'à exactement celui-ci. Les variantes pour une "distribution" donnée sont conservées dans un sous-répertoire nommé *_variants du répertoire "filesystems/". Vous pouvez créer vos propres variantes en exportant un "disque" sous l'onglet "Disques". - Noyau : la version du noyau, choisie parmi celles disponibles dans le sous-répertoire "kernels/" de l'installation Marionnet. SECTION 'UML': - Terminal : type de terminal à utiliser pour contrôler la machine virtuelle. Les choix possibles sont : (X HOST) terminal texte avec possibilité de lancer des applications graphiques sur le serveur X de l'hôte (l'option nolisten tcp du serveur X doit être désactivée), et (X NEST) serveur graphique indépendant permettant d'utiliser l'environnement de bureau des machines en disposant.

source: Initial hard disk state. The virtual machine will start by default with this variant of the chosen distribution.
fr: État initial du disque dur. La machine virtuelle peut être démarrée en utilisant une variante (état d'une machine enregistré préalablement pour une ditribution donnée).

source: Integrated switch ports
fr: ports du commutateur intégré

source: Invalid directory
fr: Répertoire inexploitable

source: Invalid directory name
fr: Nom de répertoire incorrect

source: Invalid file extension
fr: Extension de fichier non autorisée

source: Invalid file name
fr: Nom de fichier incorrect
