Repository: Kakadu/marionnet
Catalog: po/*.po
Languages: fr

source: Invalid size
fr: Taille incorrecte

source: Invoking dot failed. Did you install graphviz? The command line is %s and the exit code is %i. Marionnet will work, but you will not see the network graph picture until you fix the problem. There is no need to restart the application.
fr: L'appel de la commande "dot" a échoué, avez-vous installé graphviz ? La ligne de commande est : %s et le code d'erreur est %i Marionnet doit pouvoir fonctionner, mais vous ne verrez pas l'image du réseau tant que vous n'aurez pas résolu ce problème. Il n'est pas nécessaire de redémarrer l'application.

source: Label
fr: Étiquette

source: Label to be written in the network sketch, next to the element icon.
fr: L'étiquette à ajouter au dessin du réseau à côté de l'icone représentant cet élément.

source: Labels
fr: Étiquettes

source: License
fr: Licence

source: Linux kernel version used for this virtual machine.
fr: Version du noyau Linux à utiliser pour cette machine virtuelle.

source: Loss %
fr: Perte %

source: MAC address
fr: Adresse MAC

source: Marionnet can use a directory of your choice for its temporary files. Every file created in the directory will be deleted at exit time. If the program is run from the Marionnet live DVD, you are advised to use a persistent directory (in /mnt/hd*), in order to not waste your system physical memory.
fr: Marionnet utilise un répertoire au choix pour chaque séance de travail. Tous les fichiers créés par Marionnet dans le répertoire de travail seront effacés à la sortie du programme. Si le logiciel est exécuté à partir du DVD Marionnet, il est conseillé d'utiliser un répertoire persistant (dans /mnt/hd*) pour ne pas occuper la mémoire vive inutilement.

source: Marionnet is running with UID 0; this is bad from a security point of view... Continuing anyway.
fr: Marionnet est exécuté depuis le compte root (UID 0). Cela n'est pas recommandé du point de vue de la sécurité et est potentiellement dangereux.

source: Marionnet saves every files belonging to a project in a file with extension .mar. It is a standard gzipped tarball which can also be opened with standard tools.
fr: Marionnet regroupe tous les fichiers concernant un même projet dans un fichier dont l'extension standard est .mar. Il s'agit en réalité d'un fichier de type tar compressé (gzip) qui peut donc être ouvert indépendamment de ce logiciel.

source: Maximum delay (ms)
fr: Retard max (ms)

source: Memory <tt>(Mb)</tt>
fr: Mémoire <tt>(Mo)</tt>

source: Minimum delay (ms)
fr: Retard min (ms)

source: Minimun edge size
fr: Ajuster la taille des arcs

source: Modify
fr: Modifier

source: Modify cloud
fr: Modifier le nuage

source: Modify crossover cable
fr: Modifier le câble croisé

source: Modify hub
fr: Modifier le concentrateur (Hub)

source: Modify machine
fr: Modifier la machine

source: Modify router
fr: Modifier le routeur

source: Modify straight cable
fr: Modifier le câble droit

source: Modify switch
fr: Modifier le commutateur (switch)

source: Modify world bridge
fr: Modifier un bridge

source: Modify world gateway
fr: Modifier une passerelle

source: Name
fr: Nom

source: Name choice
fr: Choix du nom

source: Name conflict
fr: Conflit de nom

source: Name of the new project
fr: Nom du nouveau projet

source: Netmask (CIDR notation)
fr: Masque réseau (Netmask, en notation CIDR)

source: Network image correctly exported to the file
fr: L'image du réseau a été exportée avec succès dans le fichier

source: New
fr: Nouveau

source: Node name
fr: Le nom du nœud

source: Nodes
fr: Nœuds

source: Number of ethernet cards (eth0, eth1 ...) of the virtual machine
fr: Nombre de cartes ethernet (eth0, eth1,...) de la machine virtuelle.

source: Number of router ports
fr: Nombre de ports du routeur

source: Open
fr: Ouvrir

source: Open a project
fr: Ouvrir un projet

source: Open an existing Marionnet project
fr: Ouvrir un projet Marionnet existant

source: Please wait...
fr: Patientez s'il vous plaît ...

source: Port
fr: Interface

source: Ports number
fr: Nombre de Ports

source: Power-off
fr: Éteindre

source: Power-off all
fr: Tout débrancher

source: Project copy to
fr: Projet copié dans

source: Project documents
fr: Documents du projet

source: Quit
fr: Quitter

source: README
fr: LISEZ-MOI

source: Randomly arrange nodes
fr: Réagencer les nœuds de façon aléatoire

source: Re-connect
fr: Rebrancher

source: Remove
fr: Supprimer

source: Remove this document
fr: Supprimer ce document

source: Report
fr: Rapport

source: Report on
fr: Rapport sur

source: Resume
fr: Réveiller

source: Resuming
fr: Réveil de

source: Reverse an edge
fr: Dessiner un arc dans le sens inverse

source: Router
fr: Routeur

source: Router name. This name must be unique in the virtual network. Suggested: R1, R2, ...
fr: Le nom du routeur. Ce nom doit être unique dans le réseau virtuel (et ne pas contenir de '.' point). Suggestion : R1, R2,...

source: Save
fr: Enregistrer

source: Save as
fr: Enregistrer sous

source: Save project as
fr: Enregistrer projet sous

source: Second byte of the IPv4 address
fr: Deuxième octet de l'adresse IPv4

source: Shutdown all
fr: Tout arrêter

source: Shutting down
fr: Débranchement de

source: Sorry, the size is invalid.
fr: Désolé, la saisie est incorrecte.

source: Start
fr: Démarrer

source: Start all
fr: Tout démarrer

source: Start in this state
fr: Démarrer dans cet état

source: Start the virtual network (machines, switch, hub, etc) locally on this machine
fr: Démarrer le réseau virtuel (machines, commutateurs, concentrateurs, etc) en local sur cette machine.

source: Starting
fr: Démarrage de

source: Stop
fr: Arrêter

source: Stopping
fr: Arrêt de

source: Straight cable
fr: Câble droit

source: Sub-network name. This name must be unique in the virtual network. Suggested: N1, N2, ...
fr: Le nom du sous-réseau. Ce nom doit être unique dans le réseau virtuel (et ne pas contenir de '.' point). Suggestion : N1, N2,...

source: Success
fr: Succès

source: Suspend
fr: Suspendre

source: Suspending
fr: Suspension de

source: Switch
fr: Commutateur (switch)

source: Switch name. This name must be unique in the virtual network. Suggested: S1, S2, ...
fr: Le nom du commutateur (switch). Ce nom doit être unique dans le réseau virtuel (et ne pas contenir de '.' point). Suggestion : S1, S2,...

source: Texts (PDF, PostScript, DVI, HTML, text)
fr: Textes (PDF, PostScript, DVI, HTML, text)

source: The canvas size is fixed to %s%% of the minimun value to contain the graph (default=0%%)
fr: Taille du canevas fixée à %s%% de la valeur minimale pour contenir le graphe (par défaut=0%%)

source: The device %s is running
fr: La machine %s est en cours d'exécution

source: The distance between labels and icons is fixed to the value %s (default=1.6)
fr: Distance entre sommets et étiquettes fixée à la valeur %s (par défaut=1.6)

source: The file "%s" must have an extension "%s", or no extension at all (in which case the extension "%s" will be added automatically).
fr: Le fichier "%s" doit avoir une extension "%s", ou aucune (dans ce cas l'extension "%s" sera automatiquement ajoutée, de plus le fichier ne doit pas contenir de point autre que celui précédent l'extension 'mar' comme dans projet.1.mar).

source: The file doesn't exists! You must choose an exiting file name.
fr: Le fichier n'existe pas! Vous devez choisir un nom de fichier existant.

source: The first network node connected to the cable
fr: Le premier nœud du réseau connecté au câble

source: The icon size is fixed to value %s (default=large)
fr: Taille des icônes fixée à la valeur %s (défaut=grand)

source: The minimum edge size (distance between nodes) is fixed to the value %s (default=0.5)
fr: Taille minimale des arcs (distance entre nœuds) fixée à la valeur %s (par défaut=0.5)

source: The name "%s" is not a valid directory. Directory names must contain only letters, numbers, dots, dashes ('-') and underscores ('_').
fr: Le nom "%s" n'est pas un nom de répertoire valide. Les noms de répertoires peuvent contenir seulement des lettres, chiffres, points, tirets et tirets bas.

source: The name "%s" is not a valid file name. A valid file name must start with a letter and can contain letters, numbers, dashes ('-') and underscores ('_').
fr: Le nom "%s" n'est pas un nom de fichier valide. Un nom de fichier valide doit commencer par une lettre et peut contenir des lettres, chiffres, tirets et tirets bas (le nom ne doit pas contenir de point comme dans projet.1.mar).

source: The name '%s' is already used in the virtual network. The names of virtual network elements must be unique.
fr: Le nom '%s' est déjà utilisé dans le réseau virtuel. Les noms des composants du réseau virtuel doivent être uniques.

source: The name must begin with a letter and can contain letters, numbers, dashes and underscores.
fr: Le nom doit commencer par une lettre et ne peut contenir que des lettres, chiffres, tirets et tirets bas (underscores).

source: The number of ports of the integrated switch
fr: Le nombre de ports du commutateur intégré

source: The process %s with pid %i allowing the simulation of %s %s died unexpectedly. It was necessary %s "%s" to maintain a consistent state.
fr: Le processus %s avec le PID %i permettant la simulation de %s %s est mort de façon inattendue. Il a été nécessaire %s "%s" pour maintenir un état consistant.

source: The project can't be saved right now. One or more network components are still running. Please stop them before saving.
fr: Le projet ne peut être enregistré maintenant. Un ou plusieurs composants réseau sont en cours d'exécution. Vous devez les arrêter avant d'enregistrer.

source: The second network node connected to the cable
fr: Le second nœud du réseau connecté au câble

source: The variant couldn't be exported to the file "%s". Many reasons are possible: - you don't have write access to this directory - the machine was never started - you didn't select the machine disk but the machine itself (you should expand the tree).
fr: La variante n'a pu être exportée dans le fichier "%s". Plusieurs raisons sont possibles: - vous n'avez pas le droit d'écrire dans ce répertoire - la machine sélectionnée n'a jamais été démarrée - vous n'avez pas sélectionné le disque de la machine mais la machine elle même (déroulez donc l'arborescence). - il n'y a plus de place sur le disque de de votre machine

source: The variant has been exported to the file
fr: La variante a été exportée dans le fichier

source: Third byte of the IPv4 address
fr: Troisième octet de l'adresse IPv4

source: Timestamp
fr: Date

source: Title
fr: Titre

source: To
fr: Vers

source: Tuning edge endpoint labels
fr: Positionnement des étiquettes aux extrémités des arcs

source: Tuning of graph edges
fr: Réglage des arcs du graphe

source: Tuning of graph nodes
fr: Réglage des nœuds du graphe

source: Tuning of icon size (machines, switch, hub, etc), without changing the icon arrangement
fr: Augmenter ou diminuer la taille des icônes (machines, commutateurs, hub, etc), sans modifier l'agencement

source: Tuning of the graph size. The surface may increase up to double (100%) the original, in which case case elements are arranged to completely fill the available space.
fr: Réglage de la taille du canevas contenant le graphe. La taille peut être agrandi jusqu'au double (100%) de la taille d'origine. Dans ce cas, les éléments sont réagencés de façon à remplir l'espace disponible.

source: Type of terminal to use to control the virtual machine. Possible choices are: X HOST terminal (providing the possibility to launch graphical applications on the host X server) and X NEST (an independent graphic server displaying all the X windows of a virtual machines).
fr: Type de terminal à utiliser pour contrôler la machine virtuelle. Les choix possibles sont : (X HOST) terminal avec possibilité de lancer des applications graphiques sur le serveur X de l'hôte (l'option nolisten tcp de Xorg doit être désactivée), et (X NEST) serveur graphique indépendant permettant d'utiliser l'environnement de bureau des machines en disposant.

source: Unknown layer 2 sub-network
fr: Nuage (sous-réseau indéterminé de niveau 2 (OSI))

source: Unsatisfied dependency
fr: Dépendance manquante

source: Variant
fr: Variante

source: Virtual X display of "%s"
fr: Écran X virtuel pour "%s"

source: Virtual machine
fr: Machine virtuelle

source: Virtual machine name. This name must be unique in the virtual network.
fr: Le nom de la machine virtuelle. Ce nom doit être unique dans le réseau virtuel (et ne pas contenir de '.' point). Suggestions: web_server, smtp_server, fw, ...

source: Virtual network
fr: Réseau virtuel

source: Wait please...
fr: Patientez s'il vous plaît ...

source: Warning
fr: Avertissement

source: Welcome to Marionnet
fr: Bienvenue dans Marionnet

source: World bridge
fr: Bridge vers l'extérieur

source: World bridge name. This name must be unique in the virtual network. Suggested: B1, B2, ...
fr: Le nom du bridge. Ce nom doit être unique dans le réseau virtuel (et ne pas contenir de '.' point). Suggestion : B1, B2,...

source: World gateway (router)
fr: Passerelle (routeur) vers l'extérieur

source: You don't have Graphviz
fr: Vous n'avez pas Graphviz ? Le programme 'dot' n'a pas été trouvé.

source: You don't have a default filesystem for virtual computers
fr: Vous n'avez pas de système de fichiers par défaut pour les machines virtuelles (fichier ou lien nommé machine-default dans le répertoire 'filesystems/' de l'installation de marionnet).

source: You don't have a default filesystem for virtual routers
fr: Vous n'avez pas de système de fichiers par défaut pour les routeurs virtuels (fichier ou lien nommé router-default dans le répertoire 'filesystems/' de l'installation de marionnet).

source: You don't have the VDE tool slirpvde
fr: vous n'avez pas installé l'outil slirpvde

source: You don't have the VDE tool vde_switch
fr: Vous n'avez pas installé l'outil vde_switch

source: You have to shut it down first.
fr: Vous devez l'arrêter au préalable.

source: You should not be root!
fr: Vous ne devriez pas être root!

source: You should select an existing document in PDF, Postscript, DVI, HTML or text format.
fr: Vous devez sélectionner un document existant et lisible au format PDF, Postscript, DVI, HTML ou texte.

source: _Help
fr: _Aide

source: _Project
fr: _Projet

source: cloud
fr: nuage

source: created on
fr: généré le

source: dot failed
fr: L'appel du programme 'dot' (graphviz) a échoué.

source: gateway
fr: passerelle

source: hub
fr: concentrateur (hub)

source: router
fr: routeur

source: switch
fr: commutateur

source: the router first port must always have a valid configuration address
fr: La première interface du routeur doit toujours avoir une adresse valide

source: to restart
fr: de redémarrer

source: to stop
fr: d'arrêter

source: world bridge
fr: bridge vers l'extérieur

source: you should choose a direction to define this parameter
fr: vous devez choisir une direction pour pouvoir définir ce paramètre

source: you should choose a port to define this parameter
fr: vous devez choisir une interface réseau pour pouvoir définir ce paramètre
